results/results_m5_large/results_m5_large_run3/oltp_read_only_t4/sysbench.log
sysbench 1.1.0-3ceba0b (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 4
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 4 tps: 124.97 qps: 2003.30 (r/w/o: 1752.95/0.00/250.35) lat (ms,95%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 4 tps: 113.50 qps: 1815.65 (r/w/o: 1588.64/0.00/227.01) lat (ms,95%): 58.92 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 4 tps: 99.10 qps: 1587.00 (r/w/o: 1388.80/0.00/198.20) lat (ms,95%): 78.60 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 4 tps: 123.30 qps: 1969.50 (r/w/o: 1722.90/0.00/246.60) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 4 tps: 122.50 qps: 1964.00 (r/w/o: 1719.00/0.00/245.00) lat (ms,95%): 53.85 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 4 tps: 123.40 qps: 1971.90 (r/w/o: 1725.20/0.00/246.70) lat (ms,95%): 52.89 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 4 tps: 127.90 qps: 2048.30 (r/w/o: 1792.40/0.00/255.90) lat (ms,95%): 50.11 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 4 tps: 126.90 qps: 2029.20 (r/w/o: 1775.40/0.00/253.80) lat (ms,95%): 51.02 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 4 tps: 98.40 qps: 1574.60 (r/w/o: 1377.80/0.00/196.80) lat (ms,95%): 68.05 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 4 tps: 103.10 qps: 1649.60 (r/w/o: 1443.40/0.00/206.20) lat (ms,95%): 61.08 err/s: 0.00 reconn/s: 0.00
[ 110s ] thds: 4 tps: 103.70 qps: 1657.50 (r/w/o: 1450.10/0.00/207.40) lat (ms,95%): 59.99 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 4 tps: 103.90 qps: 1664.81 (r/w/o: 1457.00/0.00/207.80) lat (ms,95%): 61.08 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            191954
        write:                           0
        other:                           27422
        total:                           219376
    transactions:                        13711  (114.24 per sec.)
    queries:                             219376 (1827.91 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      114.2444
    time elapsed:                        120.0147s
    total number of events:              13711

Latency (ms):
         min:                                   20.97
         avg:                                   35.01
         max:                                  183.10
         95th percentile:                       58.92
         sum:                               480018.25

Threads fairness:
    events (avg/stddev):           3427.7500/17.50
    execution time (avg/stddev):   120.0046/0.00